{
  "articles": [
    {
      "title": "Toronto council butts heads over where to put new shelters",
      "link": "https://www.cbc.ca/news/canada/toronto/toronto-council-shelter-delegated-authority-debate-1.7593453",
      "excerpt": "At issue at council Thursday was a motion requesting amendments to the zoning bylaw to build slightly larger buildings at six new shelter sites that could be repurposed as affordable housing in the future.",
      "text": "Council passed motions on Thursday to amend the zoning bylaws for all six sites, to add parking and other features at specific shelters, and to create a leadership team to navigate consultations with local officials and residents.",
      "motion_referenced": true
    },
    {
      "title": "Brass Rail Tavern Proposal Among 3 Set To Be Refused By Toronto Council This Week",
      "link": "https://storeys.com/toronto-housing-proposals-refused-july/",
      "excerpt": "City Council's decision will determine refusal of three proposed developments, including the Brass Rail Tavern redevelopment.",
      "text": "699-707 Yonge Street, 1-17 Hayden Street, and 8 Charles Street East, 110 Sheppard Avenue East, 30-36 Hendon Avenue",
      "motion_referenced": true
    },
    {
      "title": "Toronto City Council Approves Northcrest's Hangar District Project at YZD",
      "link": "https://www.connectcre.ca/stories/toronto-city-council-approves-northcrests-hangar-district-project-at-yzd/",
      "excerpt": "Toronto city council has unanimously approved the first phase of the massive redevelopment of the former Downsview Airport Lands.",
      "text": "Toronto city council has unanimously approved the first phase of the massive redevelopment of the former Downsview Airport Lands.",
      "motion_referenced": true
    },
    {
      "title": "Toronto city councillors to make $170K after approving 24% pay bump",
      "link": "https://globalnews.ca/news/11102739/toronto-city-councillors-pay/",
      "excerpt": "Councillors voted 15-8 in favour of a 24 per cent pay raise following a city council debate on Thursday. The recommendation, which was put forth in a staff report, increases the base salary for elected municipal officials to $170,588 from $137,537.",
      "text": "For the first time in 19 years, the annual salary to be a Toronto city councillor is going up significantly. Councillors voted 15-8 in favour of a 24 per cent pay raise following a city council debate on Thursday. The recommendation, which was put forth in a staff report, increases the base salary for elected municipal officials to $170,588 from $137,537. According to the staff report, the increase will cost the city almost $1 million more in salaries and benefits in 2025. Councillors haven't had a sizeable pay increase since 2006. Council adopted the recommendations with amendments, which included allowing a first deputy mayor to be compensated at the mayoral rate. For example, that would apply in situations where the mayor's office becomes vacant in accordance with section 204 of the City of Toronto Act, 2006, for a period of 30 days or more, until such time as a mayor is elected. Toronto councillors have trailed similar counterparts in salary for years. In nearby Mississauga and Markham, councillors there make $173,117 and $161,054 annually, respectively. Despite making nearly $100,000 more than the councillors' current salary, Mayor Olivia Chow wasn't convinced the hike was necessary. Chow abstained from Thursday's vote alongside Coun. Jon Burnside and Coun. Jennifer McKelvie.",
      "motion_referenced": true
    },
    {
      "title": "Emma Teitel: Toronto City Council gave itself a 24% raise. Torontonians can't do the same",
      "link": "https://nationalpost.com/opinion/emma-teitel-toronto-city-council-gave-itself-a-24-raise-torontonians-cant-do-the-same",
      "excerpt": "After a short debate late last week, council approved a 24 per cent pay raise that will increase each of the 25 councillors' salaries by roughly $33,000 this year — from $137,537.40 to $170,588.60.",
      "text": "There are few announcements more excessively hyped these days, and fundamentally misleading, than the publication of Ontario's annual “Sunshine List.” The list, published this month, reveals the rafts of provincial civil servants who are making $100,00 a year or more and supposedly living in the lap of luxury. In reality, of course, it's the lap of modesty. The Sunshine List was born three decades ago, in 1996. Adjusted for inflation, the original $100,000 benchmark is today the equivalent of roughly $185,000. In other words, unless she has rich parents, a Torontonian who makes one hundred grand a year and change is less likely to be sitting pretty in a detached house in Rosedale, and more likely to be poring over condo listings in Oshawa in the hope she can afford to buy real estate in the GTA, period. All of which is to say, the fact that Toronto city councillors will soon be paid $170,000 — well below the inflation-adjusted Sunshine List threshold — is not in and of itself a glaring problem. The glaring problem is that the councillors voted to give themselves that raise. After a short debate late last week, council approved a 24 per cent pay raise that will increase each of the 25 councillors' salaries by roughly $33,000 this year — from $137,537.40 to $170,588.60. No, city councillors aren't on the Sunshine List, but the fact remains that it still shapes how many Ontarians, especially Torontonians, perceive public wealth. And right now, wealth is hard to come by in Toronto. Indeed, when a broadcast reporter asked a passerby in downtown Toronto what she thought about council's 15–8 vote in favour of the 24 per cent raise, she said, mouth agape: “Read the room.” The room is bleak. Food bank visits in Toronto hit 3.49 million last year — a 273 per cent increase from before the pandemic. Meanwhile the city continues to face a severe housing and affordability crisis. Toronto Mayor Olivia Chow was elected on a promise of sizeable tax hikes followed by vastly improved city services. Unfortunately, most residents have seen the former materialize, not the latter. (Chow, whose salary will not change, abstained from Thursday's vote, and referred to the councillor wage increase as “a bit steep.”) Now add economic dread fuelled by U.S. President Donald Trump's tariffs, and it's no wonder public reaction to city council's self-directed pay hike is less than positive. This doesn't mean, however, that a councillor pay hike isn't warranted. Until last week, Toronto city councillors had not had a meaningful salary increase since 2006. A recent staff report indicates that Toronto's councillors are among the lowest paid per constituent when compared to other councils in smaller municipalities — despite managing gargantuan wards and overseeing the nation's largest municipal budget. Article content It's self-evident that if we want young, talented people to run for office in a prohibitively expensive city like Toronto, they should receive a salary that allows them to raise a family there while working an exceedingly demanding, public-facing job. But it is also self-evident that the middle of an affordability crisis exacerbated by profoundly destabilizing world events is not the right time for politicians to give themselves a massive raise. In fact, no time may be the right time — so long as the people voting on the raise are the ones receiving it. It doesn't have to be this way: in cities like Vancouver and Calgary, independent bodies — not councillors themselves — set elected officials' salaries, removing the perception, and the reality of a conflict of interest. Toronto City Councillor Shelley Carroll addressed this dilemma head on when she pointed out that it is “legislatively impossible” for city council to leave the remuneration issue to an impartial outside party. But then she briefly raised an alternative — approving the raise not for the current sitting members of council — but for the next term of council. That would have allowed voters to decide whether their elected officials deserved it — introducing at least a measure of accountability and avoiding the impression that councillors are feathering their own nests mid-term. Article content Unfortunately, city council didn't pursue that option. Instead, they chose a path that will most certainly undermine trust in government — and for good reason. When unelected Torontonians go years without a raise, they don't simply get to give themselves one when the right moment presents itself. We all face unfairness in the workplace; most of us do not possess the power of the public purse to make it fair. To sharpen the knife, it's often the city itself that contributes to lost wages. When municipal bureaucracy bungles CaféTO, or when a local councillor champions a development that kills foot traffic in front of a small business — the bottom lines of average Torontonians decline. It's a perverse look that their leaders get to turn around and increase their own. The personal fortunes of Toronto city councillors will soon improve significantly. I suspect their political ones will not.",
      "motion_referenced": true
    },
    {
      "title": "Bubble Zone Bylaws: CCLA Writes to Toronto City Council to Raise Charter Concerns",
      "link": "https://ccla.org/fundamental-freedoms/bubble-zone-bylaws-ccla-writes-to-toronto-city-council-to-raise-charter-concerns/",
      "excerpt": "",
      "text": "TORONTO – The Canadian Civil Liberties Association just sent a letter to Toronto City Council expressing concerns about the potential adoption of a “bubble zone” bylaw prohibiting offensive protests near various types of community gathering spaces. This type of bylaw raises serious Charter issues. While we denounce hateful speech and intolerance and are committed to working towards a more inclusive and equal society, in our view, passing punitive laws that give municipalities and the police the discretion to broadly restrict peaceful expression is not a rights-respecting way of achieving this goal. One of the key points raised in our letter is that law enforcement already has broad powers to maintain order at protests. Police can, when necessary, use their powers to create and enforce space between two groups that are protesting against each other or facilitate access to community buildings or private property. Additionally, existing criminal laws do not only target a wide range of physically violent conduct—they also prohibit a host of other conduct that does not involve physical violence. Another focus of our letter is the meaning and importance of freedom of expression and freedom of peaceful assembly in a democracy. These rights are often the tools that marginalized groups use to advocate for, and achieve, societal change. Once broad limits on expression and protests are on the books, they are often used to stifle the peaceful expression of marginalized communities. Just because a protest is disruptive or offensive does not mean that it is violent or that it should be prohibited. While freedom of expression is not absolute, the Supreme Court of Canada has recognized that there is no place in a democracy for a right not to be offended. Finally, we also expressed concerns about the City’s online consultation process, as the survey available to the public sometimes presents a skewed, if not misleading, perspective on bubble zone bylaws. To our knowledge, the survey also lacks safeguards to ensure only Toronto residents participate, raising concerns about its reliability. We urged the City to address these issues in order to promote a fair, transparent, and reliable consultation. Read here CCLA’s letter to Toronto City Council.",
      "motion_referenced": true
    },
    {
      "title": "Toronto to allow larger apartment buildings around some transit stations",
      "link": "https://www.theglobeandmail.com/canada/article-toronto-housing-development-transit-density-olivia-chow-rob-ford/",
      "excerpt": "",
      "text": "The Ontario government, alongside Toronto City Hall, recently announced planning reforms in Canada’s largest city that would legalize larger apartment buildings around most transit stations. Ontario Housing Minister Rob Flack and Toronto Mayor Olivia Chow jointly announced the changes on Aug. 15. They alter Toronto’s official plan in 120 mass transit station areas, or MTSA, around transit stations or stops. Within a 200-metre radius of stations, 30-storey towers are now permitted under certain circumstances, and six-storey apartments are allowed even on side streets. Within approximately 800 metres of a station, four-storey apartments are now permitted. Fourteen more MTSA zones remain under negotiation. The announcement “definitely indicates a change of direction in Toronto,” said planning consultant Blair Scorgie. “It increases the baseline for density. But there is uncertainty about how the city will actually implement this.” City council needs to pass these changes before construction begins, and they are likely to provoke debate in the lead-up to next October’s municipal election. Experts also say other tax and policy shifts are required to revive the city’s stalled housing sector. Toronto and other major cities are facing pressure from higher levels of government to facilitate construction and address the country’s housing shortage. Mr. Flack said the new approach would allow for 1.5 million more homes to be built in Toronto over the next 25 years. Toronto must still answer to the federal government for its commitments to planning reform. The city could forfeit about $30-million in federal funding if it does not legalize six-unit apartments across the entire city. The sixplex change was one of several requirements Ottawa set for Toronto in exchange for funding from its Housing Accelerator Fund. Last week, federal Housing and Infrastructure Minister Gregor Robertson met with Ms. Chow; the two declined to comment on that dispute. The MTSA news does, however, resolve a standoff between the city and the province. In 2019, the Ford government defined 180 mass transit station areas in Toronto, requiring the city to set certain density targets to take advantage of that transit infrastructure. Toronto then created new zoning for those areas, but the city’s response was widely criticized as inadequate. The provincial government did not sign off on most of Toronto’s proposals, leaving the city in limbo. Jason Thorne, Toronto’s chief planner, said the new density reforms were negotiated by city and provincial staff. Queen’s Park was “looking for a more ambitious approach to planning around the station areas,” he said. “We welcome the decision. We think these densities are appropriate.” For the new Toronto policies to be fully implemented, the city will need to draw detailed maps of the transit station areas, and get new zoning approved by council. “We are working very quickly to address that,” Mr. Thorne said. “Normally this would take a year or more for each area, so we are very conscious of the timeline.” Mr. Thorne’s department aims to complete the zoning work by next spring. “It’s not a done deal,” said Alex Beheshti, a senior research associate with the Missing Middle Initiative at the University of Ottawa. “Chow will need to shepherd this through city council, and she doesn’t have a great record of that.” Mr. Beheshti referred to a June vote where city council compromised by allowing sixplex apartments in some wards, but not the whole city, and Ms. Chow didn’t speak during the debate. “She’s not going to be able to remain silent on this.” The new changes provide some good news for progressives: The city’s “inclusionary zoning” comes into effect in most MTSA areas. Under this policy, which has been championed by left-leaning councillors and Ms. Chow, condo buildings of 100 or more units will need to ensure five per cent of them are affordable rentals. However, for private development projects already in the works, this presents a new, potentially prohibitive cost. “While enabling the city’s use of inclusionary zoning is overdue as a tool to deliver meaningful affordable housing, the timing of the Minister’s decision will delay and potentially negatively impact certain projects,” said lawyer David Bronskill, a partner at Goodmans LLP who often represents private developers in negotiations with the city. “Unfortunately, inclusionary zoning only works if development projects actually proceed to construction.” Inclusionary zoning policies exclude purpose-built rental buildings and all buildings with fewer than 100 units. Mr. Scorgie suggested this could create an incentive for smaller development projects and smaller builders. For these kinds of projects to work, though, he said governments “will need to take a hard look at other kinds of reform.” That could include city regulations about the size and shape of structures, and building codes that forbid European-style buildings with one set of exit stairs. The policy differences between the province and the city reflect larger tensions within planning in Ontario. Since 2005, the province has focused on new growth as “intensification” within cities. Municipal governments must then implement zoning – regulations for each specific site – that brings that policy to ground level. In Toronto and other high-growth cities, zoning has generally not allowed apartment buildings or large commercial buildings by default. Instead, developers and builders typically negotiate site-by-site to amend city regulations. This often involves an appeal to the Ontario Land Tribunal. These new reforms could make for a more straightforward process in some cases, Mr. Beheshti said. Previously, areas near transit “were identified for greater density in provincial policies, but the specifics weren’t there,” he explained. For builders, “there was a yes at the end of the tunnel, but you had to run a gauntlet of ‘no’ to get there.” For some properties, Mr. Beheshti said that will now become less arduous. However, he pointed out: “Next year is an election year, and the mayor is in a precarious position. How things shake down at city council could be very different.”",
      "motion_referenced": true
    },
    {
      "title": "Bubble zones and dangerous dogs on Toronto city council agenda",
      "link": "https://www.cbc.ca/news/canada/toronto/city-council-meeting-bubble-zones-dangerous-dogs-raves-parks-1.7515368",
      "excerpt": "",
      "text": "Bubble zones and dangerous dogs are on the agenda as Toronto city council kicks off three days of meetings on Wednesday. Those are just two of the big issues coming to council, in addition to a lawsuit over Gardiner Expressway construction, potential updates to park rules, a city beauty plan and more. Here's a look at what to expect: Answers coming on planned 'bubble zone' bylaw Council should get some answers to questions surrounding a plan for a bylaw that would ban demonstrations directly outside places of worship, faith-based schools and cultural institutions. According to a city council motion passed in December, the proposed 'bubble zone' bylaw would create community safety zones to support 'the City's commitment to keeping Torontonians safe from hate' and protect Charter rights 'that address impacts of demonstrations that target people based on their identity as prohibited under the Ontario Human Rights Code.' The bylaw, sought by councillors following a wave of protests largely spurred by the Oct. 7 attack on Israel and the resulting war in Gaza, was supposed to be ready by the end of March. Staff are now expected to bring a report on bubble zones back to council next month, with a proposed bylaw and recommendations. Coun. Gord Perks has asked city staff questions about the language used in an online survey consulting the public on the issue. The request followed a letter from the Canadian Civil Liberties Association that says while the survey said the bylaw is not intended to limit peaceful protest, it would do just that, violating the Charter. It also points out the survey was anonymous and could be taken by people not living in Toronto, and that it failed to mention that a similar bylaw in another municipality is currently under legal challenge. Community safety considerations Downtown Coun. Chris Moise is withdrawing his motion that would have added some red tape affecting the city's rave scene, his chief of staff confirmed ahead of the meeting. Moise had introduced a motion to urge the Alcohol and Gaming Commission of Ontario give the city more power to deny special occasion permits (SOPs) — the temporary liquor licenses needed for electronic music raves in spaces like parks and warehouses. Moise says he and other councillors have heard a 'surge' of concerns around public safety, dangerous overcrowding and noise complaints related to rave parties hosted by certain, unnamed non-profit organizations. 'While the majority of non-profit events in our city contribute positively to our community, a few have exploited regulatory exemptions, undermining the public trust and safety that these guidelines are intended to protect,' Moise said in his motion. The motion was intended to enhance local oversight of event planning and establish a municipal complaint process to quickly address grievances related to SOPs, he said. Another safety concern going before council has to do with the bylaw surrounding dangerous dogs. Council will consider recommendations to strengthen the bylaw to enforce signage outside the homes of owners of dogs that have been deemed dangerous by the city following reported attacks. Currently, Toronto has more than 300 dangerous dogs in its registry. Owners are already required to post signs warning about their presence, but staff found some condo buildings don't allow the signage, something the new motion would address. Report on lawsuit over Gardiner work delays As the city sues a multinational consulting firm for alleged mistakes the city claims caused massive delays on Gardiner Expressway construction, a report is due back this week on whether the company should be suspended from being eligible to bid on city contracts — and if so, for how long. The city says design errors by WSP Canada Inc. delayed work on a stretch of the highway between Jarvis and Cherry streets by eight months in 2021. The city is looking for at least $36 million from the firm through the lawsuit filed at Ontario's Superior Court of Justice in February. The city alleges the mistakes required several fixes that led the city to pay for more costly accelerated work. 'The city has suffered significant additional costs caused by WSP's design errors,' reads the city's statement of claim filed on Feb. 28. 'Despite requests from the city, WSP has failed to or refused to compensate the city.' The firm has not responded to CBC Toronto's request for comment on the lawsuit. A notice to defend the suit has been filed on the company's behalf by a Toronto-based construction lawyer, who has also not responded to a request for comment. None of the allegations have been tested in court. Updating city park rules, beautifying public spaces Also being considered Wedneday: A motion recently introduced by Coun. Josh Matlow, asking city staff to review city park rules to see which ones are archaic, burdensome or unnecessary. In an interview with CBC Toronto last week, Matlow said it's essential to make parks as enjoyable as possible in a city where many people don't have backyards. Matlow says the motion comes after a resident sent him a photo of a sign in a city park that said picnics, kite flying, ball playing and frisbee throwing are prohibited without permits and that cyclists need to get off their bikes on hills. The city's bylaws say those permitting rules are only for groups of 25 or more, but that detail isn't found on the park sign. 'I don't want the city managing our parks. I want the city being visionaries. I want us to look around the world, look for best practices that are working and then adopt them here,' Matlow said. The motion also asks staff to look at providing more food options in city parks, expanding on a pilot program that allowed alcohol in some parks last year. Another motion coming before council Wednesday will look at ways to beautify the city's public spaces. The city's planning, transportation and parks divisions have developed a plan 'towards a beautiful city,' outlined in a report that was unanimously approved by the mayor's executive committee last week, before going to city council for consideration this week. 'As Toronto's population continues to grow, its parks and public realm need to be expanded, enhanced, and better maintained to serve residents and visitors, as they face an increased intensity of use,' the staff report set to go before council reads.",
      "motion_referenced": true
    }
  ]
}